In [3]:
import pandas as pd

In [4]:
df = pd.read_csv("C:/Users/bhave/01. Supervised Learning/pandas_for_everyone-master/data/gapminder.tsv", sep= '\t')

In [5]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [6]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [9]:
df.shape

(1704, 6)

In [10]:
df.shape[0]

1704

In [11]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [12]:
df.index

RangeIndex(start=0, stop=1704, step=1)

In [13]:
df.values

array([['Afghanistan', 'Asia', 1952, 28.801, 8425333, 779.4453145],
       ['Afghanistan', 'Asia', 1957, 30.331999999999997, 9240934,
        820.8530296],
       ['Afghanistan', 'Asia', 1962, 31.997, 10267083, 853.1007099999999],
       ...,
       ['Zimbabwe', 'Africa', 1997, 46.809, 11404948, 792.4499602999999],
       ['Zimbabwe', 'Africa', 2002, 39.989000000000004, 11926563,
        672.0386227000001],
       ['Zimbabwe', 'Africa', 2007, 43.486999999999995, 12311143,
        469.70929810000007]], dtype=object)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
country      1704 non-null object
continent    1704 non-null object
year         1704 non-null int64
lifeExp      1704 non-null float64
pop          1704 non-null int64
gdpPercap    1704 non-null float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

## SUB SETTING

In [15]:
country_df = df['country']

In [16]:
country_df.head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [17]:
country_df.shape

(1704,)

In [18]:
type(country_df)

pandas.core.series.Series

In [19]:
subset = df[['country', 'continent', 'year']]

In [20]:
subset.head()

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

In [21]:
subset.shape

(1704, 3)

In [23]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [22]:
print(df.loc[0])

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap        779.445
Name: 0, dtype: object

In [25]:
print(df.loc[[0,10,25]])

        country continent  year  lifeExp       pop    gdpPercap
0   Afghanistan      Asia  1952   28.801   8425333   779.445314
10  Afghanistan      Asia  2002   42.129  25268405   726.734055
25      Algeria    Africa  1957   45.685  10270856  3013.976023

In [29]:
print(df.loc[38:45,['country', 'continent']])

   country continent
38  Angola    Africa
39  Angola    Africa
40  Angola    Africa
41  Angola    Africa
42  Angola    Africa
43  Angola    Africa
44  Angola    Africa
45  Angola    Africa

In [30]:
print(df.iloc[1])

country      Afghanistan
continent           Asia
year                1957
lifeExp           30.332
pop              9240934
gdpPercap        820.853
Name: 1, dtype: object

In [31]:
df.iloc[-1]

country      Zimbabwe
continent      Africa
year             2007
lifeExp        43.487
pop          12311143
gdpPercap     469.709
Name: 1703, dtype: object

In [32]:
subset = df.iloc[:,[0, -1]]
subset.head()

       country   gdpPercap
0  Afghanistan  779.445314
1  Afghanistan  820.853030
2  Afghanistan  853.100710
3  Afghanistan  836.197138
4  Afghanistan  739.981106

## Grouped Calculations

### Q. For each year in the data, what was the average life expectancy?

In [33]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [34]:
df.groupby('year')['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [36]:
df.groupby(['year', 'continent'])[['lifeExp', 'gdpPercap']].mean()

                  lifeExp     gdpPercap
year continent
1952 Africa     39.135500   1252.572466
     Americas   53.279840   4079.062552
     Asia       46.314394   5195.484004
     Europe     64.408500   5661.057435
     Oceania    69.255000  10298.085650
1957 Africa     41.266346   1385.236062
     Americas   55.960280   4616.043733
     Asia       49.318544   5787.732940
     Europe     66.703067   6963.012816
     Oceania    70.295000  11598.522455
1962 Africa     43.319442   1598.078825
     Americas   58.398760   4901.541870
     Asia       51.563223   5729.369625
     Europe     68.539233   8365.486814
     Oceania    71.085000  12696.452430
1967 Africa     45.334538   2050.363801
     Americas   60.410920   5668.253496
     Asia       54.663640   5971.173374
     Europe     69.737600  10143.823757
     Oceania    71.310000  14495.021790
1972 Africa     47.450942   2339.615674
     Americas   62.394920   6491.334139
     Asia       57.319269   8187.468699
     Europe     70.775033  12479.575246
     Oceania    71.910000  16417.333380
1977 Africa     49.580423   2585.938508
     Americas   64.391560   7352.007126
     Asia       59.610556   7791.314020
     Europe     71.937767  14283.979110
     Oceania    72.855000  17283.957605
1982 Africa     51.592865   2481.592960
     Americas   66.228840   7506.737088
     Asia       62.617939   7434.135157
     Europe     72.806400  15617.896551
     Oceania    74.290000  18554.709840
1987 Africa     53.344788   2282.668991
     Americas   68.090720   7793.400261
     Asia       64.851182   7608.226508
     Europe     73.642167  17214.310727
     Oceania    75.320000  20448.040160
1992 Africa     53.629577   2281.810333
     Americas   69.568360   8044.934406
     Asia       66.537212   8639.690248
     Europe     74.440100  17061.568084
     Oceania    76.945000  20894.045885
1997 Africa     53.598269   2378.759555
     Americas   71.150480   8889.300863
     Asia       68.020515   9834.093295
     Europe     75.505167  19076.781802
     Oceania    78.190000  24024.175170
2002 Africa     53.325231   2599.385159
     Americas   72.422040   9287.677107
     Asia       69.233879  10174.090397
     Europe     76.700600  21711.732422
     Oceania    79.740000  26938.778040
2007 Africa     54.806038   3089.032605
     Americas   73.608120  11003.031625
     Asia       70.728485  12473.026870
     Europe     77.648600  25054.481636
     Oceania    80.719500  29810.188275

In [38]:
flatten = df.groupby(['year', 'continent'])[['lifeExp', 'gdpPercap']].mean().reset_index()
flatten.head()

   year continent    lifeExp     gdpPercap
0  1952    Africa  39.135500   1252.572466
1  1952  Americas  53.279840   4079.062552
2  1952      Asia  46.314394   5195.484004
3  1952    Europe  64.408500   5661.057435
4  1952   Oceania  69.255000  10298.085650

In [42]:
flatten.nunique()

year         12
continent     5
lifeExp      60
gdpPercap    60
dtype: int64

In [45]:
flatten['year'].value_counts()

1982    5
1977    5
1972    5
1967    5
1962    5
1957    5
1952    5
2007    5
2002    5
1997    5
1992    5
1987    5
Name: year, dtype: int64

In [46]:
s = pd.Series(['bhavesh', 30])

In [47]:
print(s)

0    bhavesh
1         30
dtype: object

In [48]:
s = pd.Series(['Bhavesh', 'Blessed'], index= ['Name', 'Status'])
print(s)

Name      Bhavesh
Status    Blessed
dtype: object

In [49]:
s.loc['Name']

'Bhavesh'

In [50]:
s.iloc[1]

'Blessed'

In [51]:
scientists = pd.DataFrame(
                data = {'Occupation': ['Chemist', 'Statistician'],
                        'Born': ['1920-07-25', '1876-06-13'],
                       'Died': ['1958-04-16', '1937-10-16'],
                       'Age': [37, 61]},
                index = ['Rosaline Franklin','William Gosset'],
                columns = ['Occupation', 'Born','Died','Age'])

scientists

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset     Statistician  1876-06-13  1937-10-16   61

In [53]:
scientists = pd.read_csv("C:/Users/bhave/01. Supervised Learning/pandas_for_everyone-master/data/scientists.csv")

In [54]:
scientists.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [55]:
ages= scientists['Age']

In [56]:
type(ages)

pandas.core.series.Series

In [63]:
ages.describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [60]:
scientists.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [64]:
ages[ages > ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [66]:
ages[(ages > ages.mean()) & (ages > 65)]

2    90
3    66
7    77
Name: Age, dtype: int64

In [67]:
first_row = scientists.iloc[1]

In [68]:
first_row

Name          William Gosset
Born              1876-06-13
Died              1937-10-16
Age                       61
Occupation      Statistician
Name: 1, dtype: object

In [69]:
first_row.index

Index(['Name', 'Born', 'Died', 'Age', 'Occupation'], dtype='object')

In [71]:
first_row.values

array(['William Gosset', '1876-06-13', '1937-10-16', 61, 'Statistician'],
      dtype=object)

In [73]:
first_row.keys()

Index(['Name', 'Born', 'Died', 'Age', 'Occupation'], dtype='object')

In [74]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [75]:
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [76]:
born_datetime = pd.to_datetime(scientists['Born'], format = '%Y-%m-%d')

In [78]:
born_datetime??

In [79]:
scientists['Born_Date']= born_datetime

In [80]:
scientists['Died_Date']= pd.to_datetime(scientists['Died'], format= '%Y-%m-%d')

In [81]:
scientists

,Name,Born,Died,Age,Occupation,Born_Date,Died_Date
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [82]:
scientists= scientists.drop(['Born', 'Died'], axis =1)

In [83]:
scientists

                   Name  Age          Occupation  Born_Date  Died_Date
0     Rosaline Franklin   37             Chemist 1920-07-25 1958-04-16
1        William Gosset   61        Statistician 1876-06-13 1937-10-16
2  Florence Nightingale   90               Nurse 1820-05-12 1910-08-13
3           Marie Curie   66             Chemist 1867-11-07 1934-07-04
4         Rachel Carson   56           Biologist 1907-05-27 1964-04-14
5             John Snow   45           Physician 1813-03-15 1858-06-16
6           Alan Turing   41  Computer Scientist 1912-06-23 1954-06-07
7          Johann Gauss   77       Mathematician 1777-04-30 1855-02-23